//Стоврити форму з трьома полями для name,surname,age та кнопкою. При натисканні на
// кнопку зчитати данні з полів, та вивести об'єкт в документ.
// Іншими словами : заповниои форму, натиснули кнопку, під формою з'явився блок з вашим
// об'єктом


let name = document.getElementById('name')
let surName = document.getElementById('surName')
let target = document.getElementById('target')

let btnSub = document.getElementById('submit')
let btnRes = document.getElementById('reset')


let arr = [];
btnSub.onclick = function (e) {

    let user = {name: name.value, surname: surName.value}
    arr.push(user)

    let div = document.createElement('div')
    target.append(div)

    arr.forEach((user, index) => {
        div.innerText = (index + 1 + '.') + ' ' +
            name.value[0].toUpperCase()+name.value.slice(1).toLowerCase() + ' ' +
            surName.value[0].toUpperCase()+surName.value.slice(1).toLowerCase()
    })
    console.log(arr)

    e.preventDefault()

    name.value = ''
    surName.value = ''
}


btnRes.onclick = function (e) {
    target.innerText = ''
}

// ==========================
// є сторінка, на якій є блок, я кому знаходиьтся цифра. написати код, який при кожному перезавантажені
// сторінки буде додавати до неї +1

// ==========================
// Є сторінка index.html (назва довільна), при відвідуванні якої в локальне сховще, в масив sessions зберігається
// інформація про дату та час відвідування сторінки. Є ще сторінка sessions.html (назва довільна),
// при відвідуванні якої потрібно відмалювати всю інформацію про відвідування сторінки index.html.
// Інфу НЕ виводити в консоль, а побудувати дом структуру під кожну сессію
// =========================
// зробити масив на 100 об'єктів та дві кнопки prev next
// при завантажені сторінки з'являються перші 10 об'єктів.
// При натисканні next виводяться настпні 10 об'єктів
// При натисканні prev виводяться попередні 10 об'єктів
//
// - Створити довільний елемент з id = text та створити кнопку.Використовуючи JavaScript, зробіть так, щоб при натисканні на кнопку зникав елемент з id="text".
//
//
// - створити інпут який приймає вік людини та кнопку яка підтверджує дію.При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік чи меньше він ніж 18, та повідомити про це користувача
//
// *** Створити 3 інпута та кнопку. Один визначає кількість рядків, другий - кількість ячеєк, третій вмиіст ячеєк.
// При натисканні кнопки, вся ця інформація зчитується і формується табличка, з відповідним вмістом.
// (Додатковачастина для завдання)
//
// *** (подібне було вище, але...будьте уважні в другій частині) створити сторінку з довільним блоком, в середині якого є значення "100грн"
// при перезавантаженні сторінки до значаення додається по 10грн, але !!!
//  зміна ціни відбувається тільки на перезавантаження, які відбулись пізніше ніж 10 секунд після попереднього.
//  При перезавантаженні, яке відбулось раніше ніж минуло 10 секунд - нічого не відбувається